<blank>
<s>
</s>
(
)
;
.
}
,
VAR_1
{
VAR_2
=
VAR_3
TYPE_1
VAR_4
METHOD_1
return
TYPE_2
public
METHOD_2
VAR_5
>
String
if
this
<
new
METHOD_3
TYPE_3
null
VAR_6
STRING_1
void
METHOD_4
TYPE_4
VAR_7
+
final
METHOD_5
==
VAR_8
:
STRING_2
TYPE_5
int
boolean
throws
!=
private
VAR_9
0
METHOD_6
static
VAR_10
false
?
true
]
[
!
try
else
name
get
throw
VAR_11
-
catch
&&
class
STRING_3
value
TYPE_6
METHOD_7
equals
for
result
VAR_12
1
INT_1
i
context
super
add
protected
long
||
VAR_13
key
STRING_4
id
size
length
instanceof
TYPE_7
VAR_14
toString
put
type
METHOD_8
getName
VAR_15
assertEquals
message
response
path
isEmpty
STRING_5
byte
synchronized
VAR_16
error
case
*
build
format
append
event
data
info
t
node
getClass
++
TYPE_8
METHOD_9
index
getValue
VAR_17
assertThat
getId
url
extends
contains
values
double
STRING_6
file
start
while
INT_2
params
/
finally
source
remove
args
assertTrue
VAR_18
obj
method
getType
element
set
list
listener
state
status
query
buffer
execute
x
count
target
position
METHOD_10
STRING_7
offset
CHAR_1
getString
b
attribute
msg
f
>=
+=
iterator
init
|
...
assertNotNull
break
token
item
n
VAR_19
TYPE_9
view
content
default
output
array
p
parameters
c
text
out
field
startsWith
STRING_8
update
writer
switch
split
to
substring
buf
pattern
handle
fail
float
VAR_20
FLOAT_1
time
line
<=
intent
className
assert
j
getContext
a
keys
delete
METHOD_11
INT_3
op
VAR_21
STRING_9
end
y
str
trim
min
nodes
string
label
TYPE_10
replace
k
title
getText
filename
operation
CHAR_2
results
toLowerCase
startTime
STRING_10
sum
getConfig
commit
fieldName
short
&
%
errors
rows
date
VAR_22
compareTo
continue
getData
fileName
getActivity
expr
METHOD_12
INT_4
arg
"id"
--
STRING_11
height
select
setValue
intValue
"true"
names
VAR_23
counter
getView
0.0
STRING_12
getTime
show
first
1L
char
open
filePath
getBoolean
toUpperCase
function
getInt
"name"
setText
STRING_13
FLOAT_2
num
main
"false"
tmp
VAR_24
0L
^
INT_5
setEnabled
TYPE_11
answer
METHOD_13
step
"\t"
-=
replaceAll
|=
var
param
CHAR_3
VAR_25
TYPE_12
"0"
1.0
STRING_14
VAR_26
getSelection
*=
endTime
setState
STRING_15
NULL
src
out.write
args.length
addComponent
INT_6
INT_7
STRING_16
STRING_17
CHAR_4
do
METHOD_14
"\n"
number
INT_8
STRING_18
STRING_19
diff
~
/=
&=
stringBuilder.append
writer.write
not
TYPE_13
METHOD_15
getIntent
transient
STRING_20
"type"
java.util.Collection
VAR_27
temp
CHAR_5
CHAR_6
CHAR_7
CHAR_8
CHAR_9
CHAR_10
FLOAT_3
TYPE_14
TYPE_15
TYPE_16
TYPE_17
java.io.IOException
java.util.ArrayList
1.0F
STRING_21
^=
java.lang.String
VAR_28
VAR_29
VAR_30
VAR_31
VAR_32
VAR_33
VAR_34
VAR_35
abstract
getColor
INT_9
INT_10
implements
>>>=
<<=
