<blank>
<s>
</s>
(
)
;
.
}
,
VAR_1
{
VAR_2
=
VAR_3
TYPE_1
METHOD_1
VAR_4
return
public
TYPE_2
METHOD_2
VAR_5
>
String
<
if
this
new
TYPE_3
METHOD_3
null
VAR_6
void
STRING_1
METHOD_4
TYPE_4
VAR_7
final
+
METHOD_5
VAR_8
:
==
private
int
TYPE_5
boolean
throws
STRING_2
VAR_9
!=
static
METHOD_6
0
VAR_10
false
?
[
]
name
try
true
!
get
VAR_11
throw
value
else
&&
-
class
catch
TYPE_6
STRING_3
for
equals
METHOD_7
VAR_12
1
result
protected
super
context
add
i
INT_1
long
key
VAR_13
||
STRING_4
id
length
size
VAR_14
instanceof
TYPE_7
toString
type
put
METHOD_8
isEmpty
getName
assertEquals
VAR_15
response
path
message
synchronized
case
byte
VAR_16
STRING_5
error
append
build
*
event
format
node
data
getValue
++
index
url
METHOD_9
VAR_17
TYPE_8
getId
info
contains
extends
getClass
assertThat
t
double
values
finally
file
STRING_6
start
while
INT_2
remove
params
source
/
args
set
status
VAR_18
buffer
getType
list
method
state
assertTrue
offset
element
listener
obj
x
query
position
execute
b
count
target
msg
STRING_7
field
>=
default
getString
assertNotNull
text
METHOD_10
break
token
attribute
...
init
iterator
view
output
item
|
p
f
parameters
+=
TYPE_9
content
VAR_19
out
array
CHAR_1
c
n
switch
className
startsWith
update
buf
to
delete
fail
writer
split
STRING_8
VAR_20
handle
intent
time
line
float
<=
substring
pattern
FLOAT_1
getContext
a
trim
VAR_21
keys
toLowerCase
METHOD_11
INT_3
j
op
STRING_9
min
title
results
end
y
assert
filename
label
TYPE_10
sum
nodes
operation
getText
commit
string
startTime
CHAR_2
replace
fieldName
str
%
~
fileName
getConfig
k
STRING_10
&
short
VAR_22
rows
expr
setValue
errors
getTime
--
date
compareTo
VAR_23
METHOD_12
getData
arg
"true"
select
getActivity
continue
height
INT_4
getBoolean
first
names
getView
setText
STRING_11
STRING_12
char
open
intValue
"name"
"id"
getInt
filePath
VAR_24
show
^
main
FLOAT_2
1L
0.0
function
STRING_13
step
toUpperCase
tmp
counter
METHOD_13
param
do
TYPE_11
-=
num
"false"
"\t"
var
0L
INT_5
setEnabled
1.0
CHAR_3
VAR_25
|=
TYPE_12
answer
STRING_14
VAR_26
replaceAll
getSelection
endTime
STRING_15
*=
out.write
"0"
number
setState
STRING_16
STRING_17
CHAR_4
"type"
src
NULL
args.length
addComponent
INT_6
INT_7
INT_8
METHOD_14
diff
/=
stringBuilder.append
writer.write
not
TYPE_13
transient
STRING_18
STRING_19
STRING_20
"\n"
&=
java.util.Collection
VAR_27
temp
CHAR_5
CHAR_6
CHAR_7
CHAR_8
CHAR_9
CHAR_10
FLOAT_3
TYPE_14
TYPE_15
TYPE_16
TYPE_17
getIntent
java.io.IOException
1.0F
java.lang.String
VAR_28
VAR_29
VAR_30
VAR_31
VAR_32
VAR_33
VAR_34
VAR_35
abstract
^=
getColor
implements
>>>=
<<=
